class Global_Vars:
    width = 300
    height = 300
    white = (255, 255, 255)
    m = 0.5  # масса диска
    g = 9.8
    maxis = 0.01  # масса оси
    r = 0.002  # радиус диска !
    R = 0.03  # радиус оси
    dt = 0.01  # шаг измерений
    T = 60  # времня измерений
    x0 = 0.05  # начальная координата
    v0 = 0  # начальная скорость
    l = 0.5  # длина пути
    x1 = 0.3  # 1 граница
    x2 = 0.4  # 2 граница

    F1 = -20
    F2 = 20
    k = 0.1
    e = 0.000001

    L_inv = 1.5  # длина стержня
    m_inv = 0.5  # масса груза
    M_inv = 1.0  # масса тележки
    dt_inv = 0.01  # шаг измерений
    T_inv = 60  # времня измерений
    x0_inv = 0.05  # начальная координата
    v0_inv = 0  # начальная скорость

    base_maxwell_button = False
